#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Plates/Plates/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Plates/Plates

To view this run in a browser, visit:
https://app.terraform.io/app/lisuk-dev/plates/runs/run-Tx31HAVfr4mSEMoE

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.archive_file.authMe-zip: Reading...
data.archive_file.workoutLibraryGet-zip: Reading...
data.archive_file.workoutLibraryGetItem-zip: Reading...
data.archive_file.workoutLibraryCreateItem-zip: Reading...
aws_dynamodb_table.workout_templates: Refreshing state... [id=WorkoutTemplates]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_dynamodb_table.workout_template_libraries: Refreshing state... [id=WorkoutTemplateLibraries]
aws_cognito_user_pool.user_pool: Refreshing state... [id=us-east-2_Gjn8eqGEv]
aws_lambda_function.authMe: Refreshing state... [id=authMe]
aws_lambda_function.workoutLibraryGetItem: Refreshing state... [id=workoutLibraryGetItem]
aws_lambda_function.workoutLibraryCreateItem: Refreshing state... [id=workoutLibraryCreateItem]
data.archive_file.authMe-zip: Read complete after 0s [id=7e6693eb0064ef36fdf9550200494b57ef0edf71]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=iam_for_lambda-20230425220706806800000001]
aws_iam_role_policy.dynamodb-lambda-policy: Refreshing state... [id=iam_for_lambda:dynamodb_lambda_policy]
aws_lambda_function.workoutLibraryGet: Refreshing state... [id=workoutLibraryGet]
aws_cognito_user_pool_domain.cognito-domain: Refreshing state... [id=plates-fitness]
aws_cognito_user_pool_client.client: Refreshing state... [id=5fmc68vidpgohos6jpnpf6a6d7]
aws_api_gateway_rest_api.api: Refreshing state... [id=j8gcbek39b]
aws_lambda_permission.workoutLibraryGet: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.authMe: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.workoutLibraryGetItem: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.workoutLibraryCreateItem: Refreshing state... [id=AllowExecutionFromAPIGateway]
data.archive_file.workoutLibraryGetItem-zip: Read complete after 1s [id=50d01c90dcd854546ff35466843253d22e5bf3b9]
data.archive_file.workoutLibraryCreateItem-zip: Read complete after 1s [id=a0ed09e0cf29b8a07828bee07556289d398e2923]
data.archive_file.workoutLibraryGet-zip: Read complete after 1s [id=b4c9e1114a8ce95d807591603c8138f984315c1b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_rest_api.api has been deleted
  - resource "aws_api_gateway_rest_api" "api" {
      - execution_arn                = "arn:aws:execute-api:us-east-2:631500494754:j8gcbek39b" -> null
        id                           = "j8gcbek39b"
        name                         = "PlatesApi"
        tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.apidef will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "apidef" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            openapi: 3.0.0
            info:
              title: Plates API
              description: API for Plates Backend
              version: 1.0.0
            servers:
              - url: 'https'
            paths:
              /auth/me:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${auth_me_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  security:
                    - CognitoUserPoolAuthorizer: [ ]
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            type: object
                            properties:
                              id:
                                type: string
                                format: uuid
                              email:
                                type: string
            
              /library:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${library_get_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  security:
                    - CognitoUserPoolAuthorizer: [ ]
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            type: array
                            items:
                              $ref: '#/components/schemas/WorkoutMetadata'
                post:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${library_post_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  security:
                    - CognitoUserPoolAuthorizer: [ ]
                  parameters:
                    - in: path
                      name: templateId
                      schema:
                        type: string
                        format: uuid
                      required: true
                  requestBody:
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateWorkoutTemplateRequest'
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/WorkoutTemplate'
              /library/{templateId}:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${library_item_get_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  security:
                    - CognitoUserPoolAuthorizer: [ ]
                  parameters:
                    - in: path
                      name: templateId
                      schema:
                        type: string
                        format: uuid
                      required: true
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/WorkoutTemplate'
            
            components:
              securitySchemes:
                CognitoUserPoolAuthorizer:
                  type: "apiKey"
                  name: "Authorization"
                  in: "header"
                  x-amazon-apigateway-authtype: "cognito_user_pools"
                  x-amazon-apigateway-authorizer:
                    providerARNs:
                      - "${cognito_user_pool_arn}"
                    type: "cognito_user_pools"
              schemas:
                CreateWorkoutTemplateRequest:
                  type: object
                  properties:
                    name:
                      type: string
                    exercises:
                      type: array
                      items:
                        $ref: '#/components/schemas/TemplateExercise'
            
                WorkoutMetadata:
                  type: object
                  properties:
                    id:
                      type: string
                      format: uuid
                    name:
                      type: string
                    version:
                      type: integer
                WorkoutTemplate:
                  type: object
                  properties:
                    id:
                      type: string
                      format: uuid
                    name:
                      type: string
                    version:
                      type: integer
                    exercises:
                      type: array
                      items:
                        $ref: '#/components/schemas/TemplateExercise'
                TemplateExercise:
                  type: object
                  properties:
                    name:
                      type: string
                    sets:
                      type: integer
                    reps:
                      type: integer
                    weight:
                      type: integer
                    rest:
                      type: integer
        EOT
      + vars     = {
          + "auth_me_arn"           = "arn:aws:lambda:us-east-2:631500494754:function:authMe"
          + "aws_region"            = "us-east-2"
          + "cognito_user_pool_arn" = "arn:aws:cognito-idp:us-east-2:631500494754:userpool/us-east-2_Gjn8eqGEv"
          + "library_get_arn"       = "arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryGet"
          + "library_item_get_arn"  = "arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryGetItem"
          + "library_post_arn"      = "arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryCreateItem"
        }
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "PlatesApi"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_cognito_user_pool.user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "user_pool" {
        id                         = "us-east-2_Gjn8eqGEv"
        name                       = "user-pool"
        tags                       = {}
        # (13 unchanged attributes hidden)

      ~ password_policy {
          - temporary_password_validity_days = 7 -> null
            # (5 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.authMe will be updated in-place
  ~ resource "aws_lambda_function" "authMe" {
        id                             = "authMe"
      ~ last_modified                  = "2023-04-28T04:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "CBOWxyM4GCX/Sa1eCnwIRNu5CbzBWuSuyQ7YUYGtPfc=" -> "data.archive_file.authMe-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.workoutLibraryCreateItem will be updated in-place
  ~ resource "aws_lambda_function" "workoutLibraryCreateItem" {
        id                             = "workoutLibraryCreateItem"
      ~ last_modified                  = "2023-04-28T04:11:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "mZegxddQdeF44jNhzPpu5aMWcFvzUBBRKBsLU/yvmXY=" -> "data.archive_file.workoutLibraryCreateItem-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.workoutLibraryGet will be updated in-place
  ~ resource "aws_lambda_function" "workoutLibraryGet" {
        id                             = "workoutLibraryGet"
      ~ last_modified                  = "2023-04-28T04:12:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "tcG5kqovnUzMiAttVVS/+FNAqra6gCBG62d/PjSYLqY=" -> "data.archive_file.workoutLibraryGet-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.workoutLibraryGetItem will be updated in-place
  ~ resource "aws_lambda_function" "workoutLibraryGetItem" {
        id                             = "workoutLibraryGetItem"
      ~ last_modified                  = "2023-04-28T04:12:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "actuLeNCEMHWGVlFrdTiACyX7/GiUZsv6GW87hM0X/4=" -> "data.archive_file.workoutLibraryGetItem-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.authMe must be replaced
-/+ resource "aws_lambda_permission" "authMe" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-2:631500494754:j8gcbek39b/*/*/*" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.workoutLibraryCreateItem must be replaced
-/+ resource "aws_lambda_permission" "workoutLibraryCreateItem" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-2:631500494754:j8gcbek39b/*/*/*" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.workoutLibraryGet must be replaced
-/+ resource "aws_lambda_permission" "workoutLibraryGet" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-2:631500494754:j8gcbek39b/*/*/*" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.workoutLibraryGetItem must be replaced
-/+ resource "aws_lambda_permission" "workoutLibraryGetItem" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-2:631500494754:j8gcbek39b/*/*/*" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 5 to change, 4 to destroy.


```
</details>
*Pushed by: @lisukdev, Action: `pull_request`*